app/controllers/posts_controller.rb

UPDATE "posts" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "a"], ["content", "a"], ["updated_at", "2023-11-20 03:19:03.108349"], ["id", 1]]
---
    def update
        if @post.update(post_params)